In [17]:
import  sqlite3

import pandas as pd

In [18]:
# create a database 
con = sqlite3.connect('my_movie.db') 

cur = con.cursor()

In [19]:
query = cur.execute("""create table action_movies(
                    title char(2),
                    year_released date(4),
                    budget numeric(6,1),
                    star char(3));""")

In [20]:
cur.execute("insert into action_movies values('avatar','2004',450000, 'Michael Ann'),('Apocalypto','2005',75000, 'Juan');")

In [21]:
query = ('select * from action_movies;')
sqlDF = pd.read_sql_query(query, con)

sqlDF

        title  year_released  budget         star
0      avatar           2004  450000  Michael Ann
1  Apocalypto           2005   75000         Juan